node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1000
          }
        }
        tensor_content: "\024\256\247?H\341\372>{\024n?\205\353\221?\256G\241?=\nW?\232\231\371?\341z\364?\205\353\221?\024\256\247?\217\302u?\327\2430?\037\205\353>\205\353\361?R\270\336?)\\\217>\315\314\254?{\024\356?\341z\224?{\024.?\341z\024?\024\256\207?\256G\201?=\n\027?\315\314\314>\315\314\014?H\341z?\024\256\307?H\341z?\366(\274?333?\024\256\007?=\n\267?\024\256G?\\\217B?\270\036\305?\244p\375?q=\352?\315\314L?\256Ga>\270\036\245?\000\000\000?\037\205\213?\366(\334>\037\205\313?\327\243\220?\303\365\210?\366(\334?\341z\224>\303\365\310?q=J?R\270\236>\\\217\302?\315\314L?33\323?\315\314\214?\217\302\365?\256G\241?)\\\017?=\nW>\256G\341?\000\000@?\327\243\360?\270\036\005?\256G\341?ff\306?=\nW>=\n\327?=\n\367?\n\327\343?\354Qx?\256Ga>)\\O?\303\365\250>\366(\334?\366(\034?{\024\356?\256G\201?\256Ga>\256G\241?\341z\264?\354Q\270>\037\205\253?\000\000\300?\037\205\353>\354Q8?=\n\267?R\270\336?\n\327\243?=\n\327?\232\231\371?\244p=?\000\000\000@q=\212>\205\353\221?33\263>\256G\341?R\270\236?=\nW?\\\217\242?=\n\327?\000\000\200>R\270\036?\024\256\307?\024\256\347?\327\243\320?\327\243\220?\315\314\254?\037\205k?\024\256\207?\205\353\361?q=\252?\303\365\250>\037\205\313?\303\365\250>\205\353\321?\315\314\214?\354Q\230?\341zT?\303\365\250>\303\365\350?\327\243p?{\024\356?\303\365\350?\024\256\307>\256Ga?\244p\235?\037\205\213?R\270\236>\205\353\021?\037\205k?33s?\341z\224>fff?\303\365\350?\024\256\207?\\\217\002?\256Ga>{\024\216?)\\\357?\037\205\353?\244p=?\366(\374?\270\036\305?\037\205\313?\232\231\371?H\341\232?\205\353Q?\354Qx?\315\314\314?\244p\275?H\341\372?\n\327\203?\244p\335?\205\353\361?\232\231\231?\327\243p?\n\327\203?)\\\257?\n\327\243>\000\000\000?33\363?\315\314\254?\232\231\331?\n\327\243?\205\353\221?\n\327\343?\000\000\000?\270\036E?\205\353\261?\217\302\365>\n\327\303?\256G!?\327\2430?\303\365\310?\354Q\330?\327\243\260?\024\256\307>\354Q\270>\354Q\270>\232\231\331?33\363?)\\O?\366(\374?R\270\236?\205\353\021?\\\217\202?\244p\335?\366(\034?H\341\272?\000\000\200>\354Qx?R\270\376?\\\217\302?\256G\241?\366(\274?\244p\375?\341z\224?\000\000\200?\327\243p?\327\243\360>{\024\316?\303\365h?ff&?\256G!?\217\302u>{\024.?\303\365h?\315\314\014?\024\256\307?\315\314L?q=\312?33\263>\000\000\240?\\\217\302>{\024\216?\000\000\300?\303\365\250?\303\365\210?\244p=?\366(\334?ff\246?\217\302\325?q=\212>\366(\234?\024\256\247?\366(\374?\205\353\321>\256G\341>\244p\275>\315\314L?{\024\316?\341z\024?q=\212>\232\231\231?)\\\017?\n\327\243>\270\036\205?\366(\274?\327\243\260?=\n\327?\205\353Q?\\\217\002?q=J?=\n\227?\n\327c?\256G\341?\205\353Q?\244p\275?\000\000\200>\315\314\254?\315\314\214?\205\353\321>=\nW?\000\000\200?\n\327\303?\327\243\220?=\nW>fff?\\\217\242?\000\000\240?\232\231\271?\366(\334>\354Q\270>\217\302\225?\217\302u>\327\2430?\n\327#?\\\217\342?q=\212?\341zT?fff?\315\314\314>\327\243\320?\366(\374?\366(\034?\205\353\321>R\270\236>\000\000\000@\205\353\321>\n\327\243>\327\2430?\205\353\221?{\024\316?33\263?)\\\317?\366(\034?q=\352?H\341\332?\256Ga>\366(\034?\315\314\354?\\\217\302>\244p\275?{\024\216?\341z\224>\000\000\000@\327\243\360>\315\314\314>\205\353\221?33\263?R\270\336?\303\365\210?33\263>\315\314\214?\315\314\214?fff?=\n\327?{\024\256>H\341:?ff\306?\\\217\302?ff\306?\303\365\250>\217\302u>\341z\364?\341z\364?\303\365\210?\315\314\254?\217\302u>\037\205\353?\000\000\000?\270\036\005?\000\000\200>H\341z?)\\O?\244p\275>\217\302\365>\n\327\243?\366(\374?\000\000\200?R\270^?H\341\372?\303\365(?\327\243\320?\232\231\231?\327\243\360?\366(\034?)\\\357?\341z\224>H\341\372?\232\231\231?\n\327c?\\\217B?\217\302\225?\000\000\340?\354Q\270>\256Ga?ff\306?ff\206?\000\000\200?q=\352?)\\\217?H\341\232?\000\000\000@{\024n?33\263?ff\206?\354Q\370?\315\314\354?\024\256\007?\\\217B?\354Q\270>\n\327c?\232\231\231?)\\\217>\303\365\350?\000\000\340?\270\036\305?{\024\216?\205\353\261?\232\231Y?\256G\341?\256G\201?\244p\375?\000\000\240?)\\\217>q=\212?\n\327#?ff\246?\256G\341?\n\327\203?\366(\374?\354Q\270>R\270\236?\\\217\342?ff\346?\000\000\300?\024\256G?=\n\367?\244p\375?\000\000\000?\303\365\350?\270\036\205?H\341\372?=\n\367?\341z\224>{\024\256>H\341\232?\315\314\314?H\341\332?\000\000\300?\n\327c?R\270\236?\n\327\243>\327\243\320?\366(\274?fff?R\270^?\327\243\360?=\nW?q=\212?\024\256\307>\n\327\343?=\n\367?\n\327c?\303\365\210?\037\205k?\244p}?\327\243p?R\270\236>\256G\341>q=\212?\244p\275?\341z\224?)\\\217?H\341:?R\270\236?q=\252?\000\000\200>\024\256\247?)\\\317?\232\231\231>\244p\275>\366(\274?\217\302\265?33\363?\024\256\307?\256G\301?\037\205+?)\\O?\327\2430?\327\243p?\354Q\270?ff&?\341z\224>R\270\336?R\270\376?\366(\374?\000\000\200?\270\036\245?\024\256\307>\\\217B?)\\\317?\n\327\343?\037\205\353?\327\243\360>\024\256\247?\366(\334?\270\036\345?\n\327c?\354Q8?)\\\317?\205\353\021?\232\231Y?ff\246?\217\302\325?33\323?)\\\217?\327\243\360>\315\314\314?)\\\357?\205\353\361?\303\365\210?33\323?\024\256\307?\n\327\243>\000\000\200>\232\231\371?\270\036\205?=\n\027?{\024\256?\303\365\210?\354Q\370?\205\353\021?{\024\356?q=\252?\037\205k?\217\302\365>=\n\367?H\341\372?q=\252?\315\314L?\205\353\221?\217\302\225?\270\036\005?\n\327\243>R\270^?\256G\201?=\n\367?\341z\224?\315\314\014?\\\217\202?\341z\324?{\024n?\244p}?\256G\341?\315\314\214?)\\O?=\n\327?\024\256\307?\256G\201?ff\346?H\341\232?\217\3025?\341z\364?\n\327\243?\\\217\302>H\341\232?\256Ga?\341z\264?\270\036E?)\\O?\217\302u?\354Qx?\341z\024?\205\353\261?\000\000\340?)\\\317?\327\243\360>\270\036\205?\256G!?\205\353\261?\366(\034?{\024n?q=J?H\341\332?\256G!?q=\n?\244p\335?\270\036\345?\303\365\350?33\363?\303\365\250>\354Q\270>R\270\236>\217\302\225?\024\256\247?=\n\027?\\\217\342?H\341\272?\354Qx?H\341\232?\244p\235?{\024.?=\n\327>\327\243\360>\037\205\253?33\323?)\\O?\341zT?q=\212?\217\3025?\270\036E?\n\327#?\244p\275?\366(\\?H\341:?\303\365\310?\232\231Y?q=\352?ff&?\n\327#?33\323?H\341\372?ff\346>\000\000\200>\037\205\213?\244p=?H\341:?ff\306?\354Q\230?\037\205\313?\256Ga>R\270\236>\270\036\005?\256G\341>\270\036E?q=J?\354Q\270>{\024\256>33s?H\341:?\\\217\202?=\nW>ff\306?\000\000\200?\327\243\260?\270\036\305?R\270\376?\244p\275?fff?\303\365\250?\315\314\014?R\270\036?\037\205\353?\037\205\353>\366(\374?\232\231Y?q=\212>\256G\341?\303\365\210?\341z\364?\366(\334?\303\365\250?H\341\332?\205\353\321>=\n\267?=\n\327?\037\205\353?=\n\267?=\nW>\232\231\331?\244p\275?\205\353\261?\366(\\?\341z\024?ff\246?\232\231\371?\303\365\210?\\\217B?\256G\301?R\270\236?\\\217\342?\270\036\345?\303\365\250>\315\314\314>\303\365h?\244p\375?R\270^?H\341z?\315\314\354?\270\036\005?\366(\\?\341z\324?\217\302\225?=\n\227?=\nW>\366(\034?\205\353\021?33\263>\270\036\005?\n\327\243>\341z\264?=\n\027?\n\327\243?\000\000\200?\244p}?H\341\332?\244p\375?\256G\201?\\\217B?\000\000\240?{\024\356?\205\353\261?\024\256\307?q=\352?\n\327\243>\315\314\314>R\270\236>\024\256\347?\244p\335?\037\205\253?\n\327\243>\315\314\314?\232\231\231?\354Q\230?)\\\217?\n\327\343?\341z\324?\256G\241?\327\243\360?\205\353\261?=\nW?\244p\275>\232\231\231>\327\243\320?\327\243\360>\024\256\307?H\341\332?\366(\334>\270\036\245?\270\036\245?\327\243\260?q=\n?\024\256\207?\366(\334?\\\217\002?\303\365\350?\\\217\302>{\024\256?=\n\267?\205\353Q?H\341:?\256Ga?{\024\256?33\263?\256Ga>\256G\241?\\\217\302>H\341\332?\n\327\303?\341zT?\232\231\031?33\323?\256G\341>{\024\316?\327\243\360>\256G\201?)\\\217?\315\314\214?\232\231\371?\037\205k?\256G\301?q=\352?\\\217\242?q=\n?\244p=?\270\036\205>\341z\024?=\n\227?\000\000\000@\024\256G?\037\205\253?\232\231Y?H\341z?\024\256G?\\\217\302?\037\205k>{\024\256?\315\314\014?{\024\356?\354Q\270>\327\243\360>H\341\232?\000\000\300?\024\256\307?\341z\224>\232\231\271?H\341\332?\366(\\?)\\O?\244p\275>\354Q\330?\270\036\005?\000\000\340?\244p\275>q=\212?H\341\232?\n\327\303?H\341\232?33\263>\\\217\002?q=\212?\366(\374?H\341\372>\270\036\205>\024\256\347?\303\365h?ff\346>ff\346?\\\217\002?\217\302u>{\024.?\327\243\260?33\323?\270\036\245?\217\302u?\205\353\021?\232\231\231>\303\365\210?q=J?{\024\256>\\\217\302>\n\327\243?=\n\227?\303\365h?\037\205\213?\244p=?)\\\217?33\363?\217\3025?=\n\367?\270\036\005?\244p=?R\270\236?\315\314\314?\244p\235?\000\000\200?\217\302\225?\341z\324?R\270\236>\354Q\330?\232\231\331?\303\365(?\205\353\221?\341z\324?\037\205\353>{\024\356?\303\365\350?\024\256G?\024\256\207?\000\000\200>\256G\341?333?q=\n?\303\365\310?R\270^?\366(\034?33s?\232\231\271?\244p\275?\327\2430?\037\205\353>)\\O?\270\036\305?\270\036\005?\037\205k>=\n\267?33\223?\217\302\225?\315\314\214?\024\256\307>\217\3025?\256G\341>33\263?q=J?\315\314L?\327\243\320?\232\231Y?33\223?\217\302\365?\270\036\205?ff\346?)\\\257?=\n\327>)\\O?\217\302\265?\024\256\347?\232\231\031?\270\036\345?33\323?ff\206?\244p\275>q=\n?\217\302u?R\270\236>q=\252?\244p=?\205\353\361?\\\217\202?=\n\027?\366(\034?\244p=?\205\353\021?\\\217\242?\303\365\250?\232\231\331?\244p\375?fff?\n\327\203?=\nW?\354Q\270?\024\256\347?\205\353\361?\205\353\321>\n\327\243>\315\314\254?H\341\372?q=\212>\341z\264?)\\\357?{\024n?q=\212>\270\036E?=\n\227?\000\000\200?\354Q8?\256G\201?\\\217\242?\n\327\203?)\\\217>\341z\224?=\nW?\256G\341>\270\036E?\327\243\320?\256Ga>\270\036\245?\256G\341>\024\256\307>H\341\372>\270\036\305?\270\036\245?\366(\334?\315\314\014?\024\256\207?\\\217B?\232\231\231>\366(\274?\327\243\260?\037\205\253?=\n\267?\366(\334>\315\314L?{\024\316?q=\352?H\341\332?\\\217B?\244p\275?\232\231\371?\000\000\200>ff&?\232\231\371?33s?\\\217\302?=\n\267?\000\000\240?\\\217\202?{\024\356?\\\217\342?\244p\275>\232\231\231>\341z\324?33\263>)\\\017?\315\314\354?\037\205k?\354Q\370?=\n\227?R\270\376?H\341\272?\315\314\354?{\024\216?\341zT?R\270\376?R\270\236?\303\365(?q=J?\354Q\270>\327\243\260?\217\302\365>\000\000\240?\315\314\354?R\270\236>\327\243\260?\270\036\345?\366(\234?\n\327\243>\270\036\005?\256G\341>\205\353\321>\354Q\330?\244p\335?\366(\034?{\024n?R\270\236?=\n\267?fff?\315\314\314?\n\327\303?)\\\217?=\n\327?\037\205\353>\205\353Q?R\270\236>\270\036\205>q=\312?\366(\034?\341z\024?\n\327c?\205\353Q?ff\306?\037\205\353?\000\000\200>\n\327\303?ff\246?=\n\367?q=\252?\354Q8?\256G\341>\256Ga?\217\302u?\037\205\353>\n\327#?\037\205\253?\\\217\002?)\\\257?q=\352?33\223?"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/ExpandDims"
  op: "ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/height/Const"
  input: "dnn/input_from_feature_columns/input_layer/height/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/Shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\350\003\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/height/Shape"
  input: "dnn/input_from_feature_columns/input_layer/height/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/height/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/height/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/height/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/height/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/height/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/height/ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/height/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1000
          }
        }
        tensor_content: "\n\327\203?\303\365(?\037\205+?{\024n?)\\O?\256G\341>\205\353\021?H\341\272?\024\256\307?\232\231\031?33\263?\217\302\225?\270\036\205?\217\302u>\232\231\371?\327\243\320?\024\256G?\232\231\031?=\n\027?\\\217\002?{\024\316?\303\365\310?\327\243\260?\037\205+?\217\302\365>q=\252?33s?\315\314\314?)\\O?\244p\335?\000\000\340?33\363?\315\314\314?\327\243p?\217\302u?\315\314\014?)\\\217>H\341:?333?H\341\372>\366(\334?)\\\317?\270\036\205?\315\314\014?\\\217B?\232\231\031?\244p=?\037\205\353>\\\217\302?ff\246?\270\036\205>H\341\332?\037\205\313?\327\243\260?\232\231\331?\270\036\005?q=\n?\341z\264?\315\314\214?\037\205\213?\232\231\271?\366(\334?\366(\234?\037\205k?\217\302\225?)\\O?\232\231\031?\217\3025?\327\243\260?\256Ga>\205\353\021?\217\302\265?\024\256G?\256G\241?\000\000\300?\037\205+?\327\243\360?\232\231\031?\270\036\205>\256G\241?R\270\336?\217\3025?ff\346>\303\365\350?H\341\372>\244p\335?\327\243\320?\217\302\265?\024\256\307>\244p\335?\315\314\214?\037\205k>\n\327\243>=\n\367?q=\n?\315\314\214?{\024\316?\327\243\320?q=\312?q=\212?\217\302u?\232\231\231?q=\212?\\\217\002?\217\302\365>\303\365h?\244p\275?\256G!?{\024\356?\205\353Q?\354Q\270?\256G\341?\341zT?\270\036\305?\256Ga?ff&?\354Q\370?\341z\224?{\024n?\270\036\205>\037\205k?\244p=?\024\256G?{\024\256?\205\353\361?q=\212>ff\306?\315\314\314?q=\252?ff\306?\244p\235?\366(\034?R\270\276?\327\243\260?\000\000\000@33\363?33\263>\256Ga?=\nW>\217\302\365?fff?ff\346>\315\314L?\\\217\302?\n\327\303?\217\3025?R\270\036?{\024\256>H\341:?\244p\275?H\341\332?\341z\264?\232\231\231>R\270\336?\232\231\271?\232\231\331?\217\302u>\354Q\270>\256G\341>\354Q8?\024\256\307?\n\327#?\244p\275>\000\000\200>)\\\357?\244p\275?H\341\232?\217\3025?\n\327\243>\\\217\302?\256Ga?\\\217\002?H\341:?\244p}?\256G\241?\037\205\253?q=J?\327\243\320?\\\217\302>=\n\027?\256G\241?\244p=?)\\\217>\217\302u?\205\353\221?\205\353Q?\037\205\353?fff?{\024n?q=\n?\303\365(?\024\256\307>\366(\274?\315\314\254?\232\231\331?\000\000\340?\366(\234?\256Ga?\341z\224?H\341:?H\341\272?\341z\364?\244p=?\000\000\000@ff\246?\303\365\350?\217\302u?H\341\232?\270\036E?\232\231\271?q=\n?\327\243\260?{\024.?\270\036\305?)\\O?\n\327\243?R\270^?\024\256\207?\000\000@?R\270\376?ff\346?\256G\301?q=\212>)\\\357?\341zT?33\223?\354Q8?\217\302\225?\315\314\314?\315\314\314?\217\302u>\315\314\254?=\nW?q=\n?\000\000@?\327\243\360?ff\346>\327\243\260?\037\205\313?\303\365\350?\327\243\220?\217\302\365>{\024\216?\366(\\?\341z\024?q=\312?\341z\224>\217\302u?\315\314\254?\327\243\220?\354Q\270?)\\\257?R\270\236?333?\000\000\300?q=\252?\303\365h?\256Ga>R\270\236>\205\353\261?\303\365\310?=\nW?\217\302u>q=\312?\037\205+?q=\312?\354Q8?{\024\356?\232\231\371?\n\327\203?\217\302\265?)\\\357?\354Q\230?333?H\341\372?\327\243\220?\\\217\202?{\024n?\256Ga>\037\205\213?\270\036\205>33\363?=\nW>\341z\264?\354Q\330?\256G\301?\232\231\231>\256G\241?H\341\232?\244p=?33\263>)\\\217?\217\302\225?33\363?ff\206?\n\327\243>33\323?\244p}?33\223?\327\243\360>\024\256\247?\341zT?\366(\334>{\024\316?\217\3025?\n\327\303?\303\365h?\270\036\205>\\\217\302>\256G\241?\000\000\000?\354Qx?\366(\374?\327\243\260?q=\212?\024\256\307>\256G\201?33s?\037\205\253?\037\205\253?\244p\335?\256Ga?\270\036E?33\323?H\341:?\327\243\360>\256G\341?\244p\375?H\341\272?\037\205k>\341z\024?33\263>ff\246?\354Q\270?\244p\235?H\341\232?\000\000\300?\327\243\320?\205\353\221?\000\000\300?\303\365(?\366(\334?\232\231\331?=\n\227?\303\365\310?\\\217\342?\024\256G?\303\365\250?ff\346?\315\314L?\315\314\314?\217\302\265?\\\217\202?\037\205+?H\341\232?=\n\227?\205\353\221?\256G\241?fff?\n\327\343?\315\314\314>\256G!?\341zT?\270\036\205?ff\206?R\270\236?\217\302u>)\\\357?ff\306?ff\206?\037\205\213?33\323?\327\243\320?\205\353\361?\315\314\014?\341zT?33\223?\270\036\005?\270\036E?\270\036\205?\366(\034?q=\n?)\\\317?33\263?\256Ga?H\341z?{\024\256>\024\256\307>\270\036\205>ff\346?q=J?\256Ga?q=\312?\024\256\307>=\n\327?\354Qx?\\\217\002?\341z\324?33\223?\000\000\200>33s?{\024\356?\205\353\021?\354Q\270>\270\036\205>\270\036E?\037\205\353>\037\205k?q=\212>ff\306?{\024n?\232\231\331?\024\256\007?\000\000\240?\256G\301?q=\312?\315\314\314>q=\n?\270\036\005?\327\243\220?=\nW?\327\243p?H\341z?\354Q\330?\303\365\250>)\\\217?\303\365\250?\244p\335?=\n\327?\024\256\247?\037\205\353>\000\000\340?ff\346?\000\000\340?\\\217\302>\270\036\245?)\\\017?\037\205\353?\037\205k?\232\231\331?\327\243\220?33\363?33s?R\270\036?\270\036\005?\000\000\340?\217\302u>\037\205\253?\270\036\305?\327\2430?\244p\275>\327\243\260?)\\\257?{\024n?\303\365h?\315\314\314?\303\365\350?=\n\027?\000\000\340?\244p\235?33\223?33\263?\217\302\225?\205\353\221?33\263>\270\036\205?\037\205+?H\341\332?)\\\017?\327\243p?\217\302\325?=\n\227?\217\302\265?\327\243\360?\024\256\247?\232\231\231>\354Q\270?\000\000\340?\303\365\250>\024\256\307?33\363?ff\246?\354Q\330?333?\n\327#?\232\231\331?{\024\356?\244p\335?{\024\356?\354Q\270>\315\314\314?\232\231Y?ff\346?\256G\341?{\024\356?)\\\257?\024\256\347?\341z\024?{\024\256>\232\231\371?\366(\334?\327\243\220?\\\217\342?\205\353\021?\\\217\002?ff&?\n\327\203?\256G\201?H\341\332?\354Q\230?\354Qx?H\341:?\244p\375?q=\212>=\nW>\366(\\?\315\314L?\n\327\243?333?\256G!?\303\365(?\205\353\321?\303\365\250?\217\302u?\270\036\245?ff\206?\024\256\207?\000\000\300?)\\\217?{\024\256>\\\217\242?\327\243\220?\\\217\242?H\341z?\n\327\343?\232\231\231?R\270\376?R\270\236>\315\314\314>\024\256\307>\205\353\361?H\341\372>\270\036\005?\354Q8?\354Q\370?{\024\316?\205\353\261?H\341z?R\270\276?\341z\264?ff&?\366(\334>\354Qx?\\\217\242?\327\243\320?\256G\341?)\\\217?\315\314L?\315\314\214?\303\365\250>R\270\276?q=J?\024\256G?{\024\356?\\\217\342?ff\306?33\323?\232\231\331?\037\205\353>33s?\341zT?q=\252?\024\256\347?R\270\036?\217\302\365?)\\O?\037\205+?\037\205\313?\205\353\261?\341zT?=\n\267?\244p=?q=\312?\024\256\307>333?\315\314\014?)\\\217?fff?\037\205k?\\\217\002?\354Q\270?q=\252?=\n\327>R\270\276?{\024\356?\303\365h?\244p\275>\232\231Y?\366(\234?\303\365\250?\\\217\242?\\\217\302?\217\302\325?\270\036\345?ff\346?\256G\201?\303\365\250?\354Q\330?33\263?=\n\267?\n\327\203?\366(\374?\327\243\220?333?=\n\027?\000\000\200?\327\243\220?H\341\272?33s?\315\314L?)\\\017?\270\036\245?q=\n?\327\243\260?\303\365\250?\366(\374?\\\217B?R\270\036?\000\000@?\000\000\200?fff?\n\327\243?fff?)\\\217?\024\256G?\341z\224>\037\205\353>\\\217\002?\256G\341?\303\365(?\270\036\305?)\\\017?R\270\236?\024\256\207?\n\327\203?\024\256\247?\303\365h?\327\2430?\037\205\313?R\270\036?\341z\264?\000\000\200>\037\205\253?H\341\332?\037\205+?\\\217\202?\205\353\221?\000\000\200>\327\243p?\\\217\342?\327\243\260?\n\327\203?\037\205\353?R\270^?\n\327\243?33\323?=\nW?\315\314\214?=\n\227?\000\000\340?\327\243\360>H\341z?\217\302\365?\\\217\002?\270\036E?\315\314\254?\354Q\230?\327\243\360>H\341\272?\327\243\360?\341z\224?\256G\241?\303\365\350?\037\205\213?\354Q\370?\\\217\302?\037\205\253?\341z\024?\366(\374?\024\256\307>R\270\236?\205\353\361?ff\246?33\363?q=\212>=\n\327>\217\302u?\217\3025?\354Q\230?\\\217\302?\341z\224?\270\036\245?\217\302\225?\n\327\243>\303\365\250?)\\\257?ff\346?\341zT?\037\205+?=\n\327?\270\036\305?)\\\217?\217\302\225?\205\353\361?\244p\335?fff?\303\365(?\244p=?\256Ga?)\\\017?ff\206?\244p\275>\232\231\331?\341z\364?\303\365\350?H\341z?\205\353\321?\341z\224>\354Q\270?\256Ga?\217\302\325?\244p}?\341z\324?{\024n?\244p\275?\315\314\014?\366(\334?\366(\034?\217\302\365>\000\000@?\000\000\200?\\\217\302>\270\036\205?\327\243\260?\270\036\205?\217\302\225?\341z\224?\217\302\365?\244p\235?\244p\275?\024\256\247?\354Q8?\\\217\002?\000\000\000?\217\302\365>\327\243\220?)\\\217>\205\353\321?{\024\256?\217\302\265?\n\327\303?\256Ga?\024\256\307?\n\327c?\341zT?333?\000\000@?\024\256\307?\024\256\347?\\\217\002?)\\\357?\303\365h?R\270\236>H\341z?33\323?ff\346>=\n\227?H\341\232?=\n\367?\n\327\203?H\341z?\354Q8?\000\000\300?=\nW?\024\256\007?\256G\341?\217\302\365>\270\036\205>\024\256\307?\366(\274?\024\256\247?\205\353\321?\341z\364?\256G!?\\\217\202?\244p\275?\205\353\261?R\270\236?\024\256\247?{\024\316?\244p\335?\n\327#?q=\212>\341z\224>R\270\236?ff\206?\303\365\350?\341zT?\303\365h?)\\\217>=\n\267?ff\246?\205\353\321?)\\\217?\232\231\371?\341z\224?\270\036\305?)\\\217>\327\243\320?\217\302\365>H\341\272?\303\365h?\270\036\205?\000\000\340?\000\000\200>{\024\216?\256G\341?\315\314L?\270\036\205>\037\205\313?\270\036\345?33\223?ff\206?\217\302u>\024\256G?\354Q\370?\n\327c?\000\000\340?\256G\301?\256Ga>33\223?ff\346?ff&?q=\n?\354Q\370?\256Ga?R\270\236?\354Q\370?H\341z?\244p\235?\341z\024?\270\036\345?\n\327c?q=J?\270\036E?\\\217B?\327\243\360?=\n\367?\354Qx?q=\212>\024\256\007?\341z\224?)\\\317?\366(\034?\217\302\225?\037\205\353?H\341\272?\354Q\270?\024\256\307?\354Q\330?R\270\236>\303\365\250?\341z\364?\000\000\000?\354Qx?q=\n?\024\256\007?q=\312?\024\256G?)\\\257?\n\327#?\000\000\000@R\270\236>q=J?\000\000@?=\n\267?\024\256\347?\232\231\231>\315\314\014?\232\231\271?\244p}?\256G!?\341z\264?\303\365\350?H\341\372?R\270\336?\244p\275?{\024\316?\244p\275>q=J?\303\365(?\232\231\231>\270\036E?\232\231\231?H\341\372?\037\205k?)\\\257?\244p\375?\n\327#?R\270\336?=\n\267?\n\327\243?R\270\036?\\\217\242?\315\314\254?{\024n?\000\000\340?)\\\317?\366(\034?\217\302\225?\303\365\250>R\270\236>\354Qx?\000\000@?=\n\227?R\270\336?\270\036\345?H\341\372>H\341\232?\n\327\303?\327\243\220?33\263>=\n\227?\205\353\261?\341zT?R\270\276?\270\036E?\256G\241?\256G\241?\217\302u>\n\327#?q=\252?\327\243\360?\037\205k?\315\314\014?\037\205\353?=\nW?H\341\332?\\\217\302?\327\243\220?q=\n?H\341\372>\270\036\005?\217\302\225?\n\327\203?\354Q\330?33\223?)\\\317?=\nW?\000\000\340?q=J?\327\243\220?\366(\\?\366(\034?\327\243p?\270\036\245?\315\314\214?{\024\256?\217\302\225?\354Qx?\000\000\000@\327\2430?\217\302\225?H\341\332?\n\327#?=\n\267?\000\000\340?333?\232\231\231>\000\000\340?=\n\327?q=\n?)\\\357?\232\231\231>\327\243\260?\244p=?R\270^?q=\352?\205\353\321>\000\000\200>\303\365\350?33s?\366(\274?=\n\327>{\024\256?\327\243\360>\217\302\365>q=\n?\270\036\005?\024\256\007?"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/ExpandDims"
  op: "ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/radius/Const"
  input: "dnn/input_from_feature_columns/input_layer/radius/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/Shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\350\003\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/radius/Shape"
  input: "dnn/input_from_feature_columns/input_layer/radius/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/radius/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/radius/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/radius/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/radius/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/radius/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/radius/ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/radius/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/concat/axis"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/concat"
  op: "ConcatV2"
  input: "dnn/input_from_feature_columns/input_layer/height/Reshape"
  input: "dnn/input_from_feature_columns/input_layer/radius/Reshape"
  input: "dnn/input_from_feature_columns/input_layer/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 2
          }
        }
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/kernel/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\002\000\000\000\006\000\000\000"
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/kernel/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.8660253882408142
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/kernel/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.8660253882408142
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/kernel/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/sub"
  op: "Sub"
  input: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/max"
  input: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/kernel/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/mul"
  op: "Mul"
  input: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/RandomUniform"
  input: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/kernel/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform"
  op: "Add"
  input: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/mul"
  input: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/kernel/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel/part_0"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/kernel/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
        dim {
          size: 6
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel/part_0/Assign"
  op: "Assign"
  input: "dnn/hiddenlayer_0/kernel/part_0"
  input: "dnn/hiddenlayer_0/kernel/part_0/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/kernel/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel/part_0/read"
  op: "Identity"
  input: "dnn/hiddenlayer_0/kernel/part_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/kernel/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/bias/part_0/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/bias/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 6
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 6
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/bias/part_0"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/bias/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 6
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 6
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/bias/part_0/Assign"
  op: "Assign"
  input: "dnn/hiddenlayer_0/bias/part_0"
  input: "dnn/hiddenlayer_0/bias/part_0/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/bias/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 6
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/bias/part_0/read"
  op: "Identity"
  input: "dnn/hiddenlayer_0/bias/part_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dnn/hiddenlayer_0/bias/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 6
          }
        }
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/kernel"
  op: "Identity"
  input: "dnn/hiddenlayer_0/kernel/part_0/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/MatMul"
  op: "MatMul"
  input: "dnn/input_from_feature_columns/input_layer/concat"
  input: "dnn/hiddenlayer_0/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/bias"
  op: "Identity"
  input: "dnn/hiddenlayer_0/bias/part_0/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 6
          }
        }
      }
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/BiasAdd"
  op: "BiasAdd"
  input: "dnn/hiddenlayer_0/MatMul"
  input: "dnn/hiddenlayer_0/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "dnn/hiddenlayer_0/Relu"
  op: "Relu"
  input: "dnn/hiddenlayer_0/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
}
node {
  name: "dnn/zero_fraction/zero"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
